In [31]:
# Collect and load entire data
import pandas as pd #pandas for data analysis and manuiplation
import numpy as np #numircal pythoh
import matplotlib.pyplot as plt #for visualization
import seaborn as sns #for visualization

In [32]:
import os #for interaction with the os

In [33]:
os.listdir(r'F:\Realworld_data_analysis\Uber_newyork_data_analysis\uber-pickups-in-new-york-city') #to list all files in a directory
files = os.listdir(r'F:\Realworld_data_analysis\Uber_newyork_data_analysis\uber-pickups-in-new-york-city')[-7:] #choosing the last 7 files we will work with

In [34]:
files

['uber-raw-data-apr14.csv',
 'uber-raw-data-aug14.csv',
 'uber-raw-data-janjune-15.csv',
 'uber-raw-data-jul14.csv',
 'uber-raw-data-jun14.csv',
 'uber-raw-data-may14.csv',
 'uber-raw-data-sep14.csv']

In [35]:
#removing an unwanted file uber-raw-data-janjune-15.csv
files.remove('uber-raw-data-janjune-15.csv')
files

['uber-raw-data-apr14.csv',
 'uber-raw-data-aug14.csv',
 'uber-raw-data-jul14.csv',
 'uber-raw-data-jun14.csv',
 'uber-raw-data-may14.csv',
 'uber-raw-data-sep14.csv']

In [36]:
path = r"F:\Realworld_data_analysis\Uber_newyork_data_analysis\uber-pickups-in-new-york-city"
#concating all files in one df
final_df = pd.DataFrame()
for file in files :
    df = pd.read_csv(path + "/"+file,encoding="UTF-8")
    final_df = pd.concat([final_df,df])

In [37]:
final_df

                  Date/Time      Lat      Lon    Base
0          4/1/2014 0:11:00  40.7690 -73.9549  B02512
1          4/1/2014 0:17:00  40.7267 -74.0345  B02512
2          4/1/2014 0:21:00  40.7316 -73.9873  B02512
3          4/1/2014 0:28:00  40.7588 -73.9776  B02512
4          4/1/2014 0:33:00  40.7594 -73.9722  B02512
...                     ...      ...      ...     ...
1028131  9/30/2014 22:57:00  40.7668 -73.9845  B02764
1028132  9/30/2014 22:57:00  40.6911 -74.1773  B02764
1028133  9/30/2014 22:58:00  40.8519 -73.9319  B02764
1028134  9/30/2014 22:58:00  40.7081 -74.0066  B02764
1028135  9/30/2014 22:58:00  40.7140 -73.9496  B02764

[4534327 rows x 4 columns]

In [38]:
final_df.shape

(4534327, 4)

In [39]:
#making a copy of df
cdf = final_df.copy()

In [40]:
cdf.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [41]:
cdf.dtypes

Date/Time     object
Lat          float64
Lon          float64
Base          object
dtype: object

In [47]:
#converting date time to the right format
cdf['Date/Time']=pd.to_datetime(cdf['Date/Time'],format='%m%d%Y %H:%M%S')
cdf['Date/Time']

0         2014-04-01 00:11:00
1         2014-04-01 00:17:00
2         2014-04-01 00:21:00
3         2014-04-01 00:28:00
4         2014-04-01 00:33:00
                  ...
1028131   2014-09-30 22:57:00
1028132   2014-09-30 22:57:00
1028133   2014-09-30 22:58:00
1028134   2014-09-30 22:58:00
1028135   2014-09-30 22:58:00
Name: Date/Time, Length: 4534327, dtype: datetime64[ns]

In [48]:
cdf.dtypes

Date/Time    datetime64[ns]
Lat                 float64
Lon                 float64
Base                 object
dtype: object

In [54]:
#getting day name from date time column
cdf['day_name']=cdf['Date/Time'].dt.day_name()

In [56]:
cdf['day']=cdf['Date/Time'].dt.day

In [57]:
cdf['minutes']=cdf['Date/Time'].dt.minute

In [60]:
cdf['month']=cdf['Date/Time'].dt.month
cdf['hour']=cdf['Date/Time'].dt.hour
cdf['year']=cdf['Date/Time'].dt.year

In [61]:
cdf.head()

,Date/Time,Lat,Lon,Base,day_name,day,minutes,month,hour,year
0,2014-04-01 00:11:00,40.7690,-73.9549,B02512,Tuesday,1,11,4,0,2014
1,2014-04-01 00:17:00,40.7267,-74.0345,B02512,Tuesday,1,17,4,0,2014
2,2014-04-01 00:21:00,40.7316,-73.9873,B02512,Tuesday,1,21,4,0,2014
3,2014-04-01 00:28:00,40.7588,-73.9776,B02512,Tuesday,1,28,4,0,2014
4,2014-04-01 00:33:00,40.7594,-73.9722,B02512,Tuesday,1,33,4,0,2014

In [63]:
cdf.dtypes

Date/Time    datetime64[ns]
Lat                 float64
Lon                 float64
Base                 object
day_name             object
day                   int64
minutes               int64
month                 int64
hour                  int64
year                  int64
dtype: object